title: WinRAR Execution Copy
id: 8a3f8d44-195a-4996-baac-4d3991d64094
status: test
description: Detects execution of WinRAR from command line.
author: Patrick Bareiss
date: 2025-07-14
tags:
    - attack.execution
    - attack.t1203
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: 
        - '\WinRAR.exe'
        - '\rar.exe'
    selection_parent:
        - ParentImage|endswith:
              - '\cmd.exe'
    condition: selection and selection_parent
falsepositives:
    - Unknown
level: medium
data: Sysmon3.xml
source: Sysmon
sourcetype: XmlWinEventLog